backend/app/controllers/definitions_controller.rb

    def update
        definition = Definition.find_by(id: definition_params[:id])
        newLike = definition.likes
        # binding.pry
        newLike = newLike + 1
        definition.update(likes: newLike)
---
SELECT "definitions".* FROM "definitions" WHERE "definitions"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "definitions" SET "likes" = ?, "updated_at" = ? WHERE "definitions"."id" = ?  [["likes", 1], ["updated_at", "2021-03-09 21:48:56.080471"], ["id", 6]]