backend/app/controllers/definitions_controller.rb

    def index
        definitions = Definition.all
---
SELECT "definitions".* FROM "definitions"

    def create

        definition = Definition.create(definition_params)
        entry = Entry.find_by(id: definition_params[:entry_id])

        #binding.pry
        entry.definition_count += 1
        entry.save
---
INSERT INTO "definitions" ("description", "example", "entry_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["description", "sdfdd"], ["example", "2343"], ["entry_id", 5], ["created_at", "2021-02-24 16:06:56.152086"], ["updated_at", "2021-02-24 16:06:56.152086"]]
SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "definitions" SET "likes" = ?, "updated_at" = ? WHERE "definitions"."id" = ?  [["likes", 1], ["updated_at", "2021-03-09 21:48:56.080471"], ["id", 6]]
UPDATE "entries" SET "definition_count" = ?, "updated_at" = ? WHERE "entries"."id" = ?  [["definition_count", 1], ["updated_at", "2021-02-24 17:34:42.360593"], ["id", 1]]

    def destroy
        definition = Definition.find_by(id: params[:id]).destroy
---
DELETE FROM "definitions" WHERE "definitions"."id" = ?  [["id", 3]]
SELECT "definitions".* FROM "definitions" WHERE "definitions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]