backend/app/controllers/entries_controller.rb

    def show
        entry = Entry.find_by(:id => params[:id].to_i)
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def index
        entries = Entry.all
---
SELECT "entries".* FROM "entries"

    def create
        #binding.pry
        if Entry.find_by(:term => entry_params[:term])
            entry = Entry.find_by(:term => entry_params[:term])
            redirect_to "/entries/#{entry.id}"
        else
            entry = Entry.create(entry_params)
---
SELECT "entries".* FROM "entries" WHERE "entries"."term" = ? LIMIT ?  [["term", "first word"], ["LIMIT", 1]]
SELECT "entries".* FROM "entries" WHERE "entries"."term" = ? LIMIT ?  [["term", "poop"], ["LIMIT", 1]]
INSERT INTO "entries" ("term", "created_at", "updated_at") VALUES (?, ?, ?)  [["term", "first word"], ["created_at", "2021-02-24 04:10:22.354427"], ["updated_at", "2021-02-24 04:10:22.354427"]]